Revit 2027 API
ElectricalSystem.HasCustomCircuitPath Property
 Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCustomCircuitPath { get; }
Public ReadOnly Property HasCustomCircuitPath As Boolean
	Get
public:
property bool HasCustomCircuitPath {
	bool get ();
}
member HasCustomCircuitPath : bool with get
Property Value
Boolean
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace